# Вводится число 0 или 1, необходимо вывести 1 или 0 соответственно.
# ===========================
# Формат ввода
#
# Число 0 или 1.
# ===========================
# Формат вывода
#
# Число 0 или 1.
# ===========================
# Примеры
#
# Тест 1
# Входные данные:
# 0
# Вывод программы:
# 1

n = int(input())
print((n+1)%2)