# Дано положительное двузначное число. Найдите число десятков в нем.
#
# Формат ввода
#
# Вводится единственное число (гарантируется, что оно соответствует условию задачи).
#
# Формат вывода
#
# Выведите ответ на задачу.
#
# Примеры
#
# Тест 1
# Входные данные:
# 42
#
# Вывод программы:
# 4
n = int(input())
print(n // 10)