# Формат ввода
#
# Вводится целое неотрицательное число N (N≤100).
# ============================
# Формат вывода
#
# Выведите 2ᴺ.
# ============================
# Примеры
#
# Тест 1
# Входные данные:
# 2
# Вывод программы:
# 4

n = int(input())
print(2 ** n)