# Последовательность Фибоначчи определяется так:
# 
# F[0]=0, F[1]=1, ..., F[n]=F[n-1]+F[n-2].
# 
# Дано натуральное число A. Определите, каким по счету числом Фибоначчи оно является, то есть выведите 
# такое число n, что F[n]=A.
# 
# Если А не является числом Фибоначчи, выведите число -1.
# 
# Формат ввода
# 
# Вводится натуральное число A.
# 
# Формат вывода
# 
# Выведите ответ на задачу.
# 
# Примеры
#
# Тест 1
# Входные данные:
# 8
# 
# 
# Вывод программы:
# 6
# 
# 
# 
# 
# Тест 2
# Входные данные:
# 10
# 
# 
# Вывод программы:
# -1
# 
# 
# 
# 
# Тест 3
# Входные данные:
# 13
# 
# 
# Вывод программы:
# 7

